theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT4_FTM1CH0SRC_FTM 0x00u     /*!<@brief FTM1 channel 0 input capture source select: FTM1_CH0 signal */
#define SOPT4_FTM2CH0SRC_FTM 0x00u     /*!<@brief FTM2 channel 0 input capture source select: FTM2_CH0 signal */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTD7 (coord A1), SPI1_MISO
  @{ */
#define BOARD_INITPINS_SPI1_MISO_PERIPHERAL SPI1   /*!<@brief Device name: SPI1 */
#define BOARD_INITPINS_SPI1_MISO_SIGNAL SIN        /*!<@brief SPI1 signal: SIN */
#define BOARD_INITPINS_SPI1_MISO_PORT PORTD        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI1_MISO_PIN 7U            /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_SPI1_MISO_PIN_NAME SPI1_SIN /*!<@brief Pin name */
#define BOARD_INITPINS_SPI1_MISO_LABEL "SPI1_MISO" /*!<@brief Label */
#define BOARD_INITPINS_SPI1_MISO_NAME "SPI1_MISO"  /*!<@brief Identifier name */
                                                   /* @} */

/*! @name PORTA0 (coord J5), SWD_CLK
  @{ */
#define BOARD_INITPINS_SWDCLK_PERIPHERAL JTAG          /*!<@brief Device name: JTAG */
#define BOARD_INITPINS_SWDCLK_SIGNAL JTAG_TCLK_SWD_CLK /*!<@brief JTAG signal: JTAG_TCLK_SWD_CLK */
#define BOARD_INITPINS_SWDCLK_PORT PORTA               /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_SWDCLK_PIN 0U                   /*!<@brief PORTA pin index: 0 */
#define BOARD_INITPINS_SWDCLK_PIN_NAME JTAG_TCLK       /*!<@brief Pin name */
#define BOARD_INITPINS_SWDCLK_LABEL "SWD_CLK"          /*!<@brief Label */
#define BOARD_INITPINS_SWDCLK_NAME "SWDCLK"            /*!<@brief Identifier name */
                                                       /* @} */

/*! @name PORTA1 (coord J6), AIR_WAKEN
  @{ */
#define BOARD_INITPINS_AIR_WAKEN_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_AIR_WAKEN_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_AIR_WAKEN_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_AIR_WAKEN_GPIO_PIN 1U                        /*!<@brief PORTA pin index: 1 */
#define BOARD_INITPINS_AIR_WAKEN_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_AIR_WAKEN_PIN 1U                             /*!<@brief PORTA pin index: 1 */
#define BOARD_INITPINS_AIR_WAKEN_CHANNEL 1                          /*!<@brief GPIOA GPIO channel: 1 */
#define BOARD_INITPINS_AIR_WAKEN_PIN_NAME PTA1                      /*!<@brief Pin name */
#define BOARD_INITPINS_AIR_WAKEN_LABEL "AIR_WAKEN"                  /*!<@brief Label */
#define BOARD_INITPINS_AIR_WAKEN_NAME "AIR_WAKEN"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_AIR_WAKEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTA2 (coord K6), TOUCH_RST
  @{ */
#define BOARD_INITPINS_TOUCH_RST_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_TOUCH_RST_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_TOUCH_RST_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_TOUCH_RST_GPIO_PIN 2U                        /*!<@brief PORTA pin index: 2 */
#define BOARD_INITPINS_TOUCH_RST_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_TOUCH_RST_PIN 2U                             /*!<@brief PORTA pin index: 2 */
#define BOARD_INITPINS_TOUCH_RST_CHANNEL 2                          /*!<@brief GPIOA GPIO channel: 2 */
#define BOARD_INITPINS_TOUCH_RST_PIN_NAME PTA2                      /*!<@brief Pin name */
#define BOARD_INITPINS_TOUCH_RST_LABEL "TOUCH_RST"                  /*!<@brief Label */
#define BOARD_INITPINS_TOUCH_RST_NAME "TOUCH_RST"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_TOUCH_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTA3 (coord K7), K64_SWDIO
  @{ */
#define BOARD_INITPINS_K64_SWDIO_PERIPHERAL JTAG         /*!<@brief Device name: JTAG */
#define BOARD_INITPINS_K64_SWDIO_SIGNAL JTAG_TMS_SWD_DIO /*!<@brief JTAG signal: JTAG_TMS_SWD_DIO */
#define BOARD_INITPINS_K64_SWDIO_PORT PORTA              /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_K64_SWDIO_PIN 3U                  /*!<@brief PORTA pin index: 3 */
#define BOARD_INITPINS_K64_SWDIO_PIN_NAME JTAG_TMS       /*!<@brief Pin name */
#define BOARD_INITPINS_K64_SWDIO_LABEL "K64_SWDIO"       /*!<@brief Label */
#define BOARD_INITPINS_K64_SWDIO_NAME "K64_SWDIO"        /*!<@brief Identifier name */
                                                         /* @} */

