theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTA4 (coord L7), USER_SW1
  @{ */
#define BOARD_INITPINS_USER_SW1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_USER_SW1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_USER_SW1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_USER_SW1_GPIO_PIN 4U                       /*!<@brief PORTA pin index: 4 */
#define BOARD_INITPINS_USER_SW1_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_USER_SW1_PIN 4U                            /*!<@brief PORTA pin index: 4 */
#define BOARD_INITPINS_USER_SW1_CHANNEL 4                         /*!<@brief GPIOA GPIO channel: 4 */
#define BOARD_INITPINS_USER_SW1_PIN_NAME PTA4                     /*!<@brief Pin name */
#define BOARD_INITPINS_USER_SW1_LABEL "USER_SW1"                  /*!<@brief Label */
#define BOARD_INITPINS_USER_SW1_NAME "USER_SW1"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_USER_SW1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTA5 (coord M8), I2S_TX_BCLK
  @{ */
#define BOARD_INITPINS_I2S_TX_BCLK_PERIPHERAL I2S0       /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_TX_BCLK_SIGNAL TX_BCLK        /*!<@brief I2S0 signal: TX_BCLK */
#define BOARD_INITPINS_I2S_TX_BCLK_PORT PORTA            /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_I2S_TX_BCLK_PIN 5U                /*!<@brief PORTA pin index: 5 */
#define BOARD_INITPINS_I2S_TX_BCLK_PIN_NAME I2S0_TX_BCLK /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_TX_BCLK_LABEL "I2S_TX_BCLK"   /*!<@brief Label */
#define BOARD_INITPINS_I2S_TX_BCLK_NAME "I2S_TX_BCLK"    /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PORTA6 (coord J7), AIR_RESETN
  @{ */
#define BOARD_INITPINS_AIR_RESETN_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_AIR_RESETN_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_AIR_RESETN_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_AIR_RESETN_GPIO_PIN 6U                        /*!<@brief PORTA pin index: 6 */
#define BOARD_INITPINS_AIR_RESETN_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_AIR_RESETN_PIN 6U                             /*!<@brief PORTA pin index: 6 */
#define BOARD_INITPINS_AIR_RESETN_CHANNEL 6                          /*!<@brief GPIOA GPIO channel: 6 */
#define BOARD_INITPINS_AIR_RESETN_PIN_NAME PTA6                      /*!<@brief Pin name */
#define BOARD_INITPINS_AIR_RESETN_LABEL "AIR_RESETN"                 /*!<@brief Label */
#define BOARD_INITPINS_AIR_RESETN_NAME "AIR_RESETN"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_AIR_RESETN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

/*! @name PORTA7 (coord J8), AIR_QUALITY_EN
  @{ */
#define BOARD_INITPINS_AIR_QUALITY_EN_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_AIR_QUALITY_EN_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_AIR_QUALITY_EN_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_AIR_QUALITY_EN_GPIO_PIN 7U                        /*!<@brief PORTA pin index: 7 */
#define BOARD_INITPINS_AIR_QUALITY_EN_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_AIR_QUALITY_EN_PIN 7U                             /*!<@brief PORTA pin index: 7 */
#define BOARD_INITPINS_AIR_QUALITY_EN_CHANNEL 7                          /*!<@brief GPIOA GPIO channel: 7 */
#define BOARD_INITPINS_AIR_QUALITY_EN_PIN_NAME PTA7                      /*!<@brief Pin name */
#define BOARD_INITPINS_AIR_QUALITY_EN_LABEL "AIR_QUALITY_EN"             /*!<@brief Label */
#define BOARD_INITPINS_AIR_QUALITY_EN_NAME "AIR_QUALITY_EN"              /*!<@brief Identifier name */
#define BOARD_INITPINS_AIR_QUALITY_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                         /* @} */

/*! @name PORTA8 (coord K8), BUZZER_PWM
  @{ */
#define BOARD_INITPINS_BUZZER_PWM_PERIPHERAL FTM1                    /*!<@brief Device name: FTM1 */
#define BOARD_INITPINS_BUZZER_PWM_SIGNAL CH                          /*!<@brief FTM1 signal: CH */
#define BOARD_INITPINS_BUZZER_PWM_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_BUZZER_PWM_PIN 8U                             /*!<@brief PORTA pin index: 8 */
#define BOARD_INITPINS_BUZZER_PWM_CHANNEL 0                          /*!<@brief FTM1 channel: 0 */
#define BOARD_INITPINS_BUZZER_PWM_PIN_NAME FTM1_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_BUZZER_PWM_LABEL "BUZZER_PWM"                 /*!<@brief Label */
#define BOARD_INITPINS_BUZZER_PWM_NAME "BUZZER_PWM"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_BUZZER_PWM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

/*! @name PORTA10 (coord M9), MB1_PWM
  @{ */
#define BOARD_INITPINS_MB1_PWM_PERIPHERAL FTM2                    /*!<@brief Device name: FTM2 */
#define BOARD_INITPINS_MB1_PWM_SIGNAL CH                          /*!<@brief FTM2 signal: CH */
#define BOARD_INITPINS_MB1_PWM_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_MB1_PWM_PIN 10U                            /*!<@brief PORTA pin index: 10 */
#define BOARD_INITPINS_MB1_PWM_CHANNEL 0                          /*!<@brief FTM2 channel: 0 */
#define BOARD_INITPINS_MB1_PWM_PIN_NAME FTM2_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_MB1_PWM_LABEL "MB1_PWM"                    /*!<@brief Label */
#define BOARD_INITPINS_MB1_PWM_NAME "MB1_PWM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_MB1_PWM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTA11 (coord L9), MB2_PWM
  @{ */
#define BOARD_INITPINS_MB2_PWM_PERIPHERAL FTM2                    /*!<@brief Device name: FTM2 */
#define BOARD_INITPINS_MB2_PWM_SIGNAL CH                          /*!<@brief FTM2 signal: CH */
#define BOARD_INITPINS_MB2_PWM_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_MB2_PWM_PIN 11U                            /*!<@brief PORTA pin index: 11 */
#define BOARD_INITPINS_MB2_PWM_CHANNEL 1                          /*!<@brief FTM2 channel: 1 */
#define BOARD_INITPINS_MB2_PWM_PIN_NAME FTM2_CH1                  /*!<@brief Pin name */
#define BOARD_INITPINS_MB2_PWM_LABEL "MB2_PWM"                    /*!<@brief Label */
#define BOARD_INITPINS_MB2_PWM_NAME "MB2_PWM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_MB2_PWM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTA12 (coord K9), I2S_TXD
  @{ */
#define BOARD_INITPINS_I2S_TXD_PERIPHERAL I2S0    /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_TXD_SIGNAL TXD0        /*!<@brief I2S0 signal: TXD0 */
#define BOARD_INITPINS_I2S_TXD_PORT PORTA         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_I2S_TXD_PIN 12U            /*!<@brief PORTA pin index: 12 */
#define BOARD_INITPINS_I2S_TXD_PIN_NAME I2S0_TXD0 /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_TXD_LABEL "I2S_TXD"    /*!<@brief Label */
#define BOARD_INITPINS_I2S_TXD_NAME "I2S_TXD"     /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTA13 (coord J9), I2S_TX_FS;I2C2_SDA
  @{ */
#define BOARD_INITPINS_I2C2_SDA_PERIPHERAL I2C2            /*!<@brief Device name: I2C2 */
#define BOARD_INITPINS_I2C2_SDA_SIGNAL SDA                 /*!<@brief I2C2 signal: SDA */
#define BOARD_INITPINS_I2C2_SDA_PORT PORTA                 /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_I2C2_SDA_PIN 13U                    /*!<@brief PORTA pin index: 13 */
#define BOARD_INITPINS_I2C2_SDA_PIN_NAME I2C2_SDA          /*!<@brief Pin name */
#define BOARD_INITPINS_I2C2_SDA_LABEL "I2S_TX_FS;I2C2_SDA" /*!<@brief Label */
#define BOARD_INITPINS_I2C2_SDA_NAME "I2C2_SDA"            /*!<@brief Identifier name */
                                                           /* @} */

/*! @name PORTA14 (coord L10), I2S_RX_BCLK;I2C2_SCL
  @{ */
#define BOARD_INITPINS_I2C2_SCL_PERIPHERAL I2C2              /*!<@brief Device name: I2C2 */
#define BOARD_INITPINS_I2C2_SCL_SIGNAL SCL                   /*!<@brief I2C2 signal: SCL */
#define BOARD_INITPINS_I2C2_SCL_PORT PORTA                   /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_I2C2_SCL_PIN 14U                      /*!<@brief PORTA pin index: 14 */
#define BOARD_INITPINS_I2C2_SCL_PIN_NAME I2C2_SCL            /*!<@brief Pin name */
#define BOARD_INITPINS_I2C2_SCL_LABEL "I2S_RX_BCLK;I2C2_SCL" /*!<@brief Label */
#define BOARD_INITPINS_I2C2_SCL_NAME "I2C2_SCL"              /*!<@brief Identifier name */
                                                             /* @} */

/*! @name PORTA15 (coord L11), I2S_RXD
  @{ */
#define BOARD_INITPINS_I2S_RXD_PERIPHERAL I2S0    /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_RXD_SIGNAL RXD0        /*!<@brief I2S0 signal: RXD0 */
#define BOARD_INITPINS_I2S_RXD_PORT PORTA         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_I2S_RXD_PIN 15U            /*!<@brief PORTA pin index: 15 */
#define BOARD_INITPINS_I2S_RXD_PIN_NAME I2S0_RXD0 /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_RXD_LABEL "I2S_RXD"    /*!<@brief Label */
#define BOARD_INITPINS_I2S_RXD_NAME "I2S_RXD"     /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTA16 (coord K10), I2S_RX_FS
  @{ */
#define BOARD_INITPINS_I2S_RX_FS_PERIPHERAL I2S0     /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_RX_FS_SIGNAL RX_FS        /*!<@brief I2S0 signal: RX_FS */
#define BOARD_INITPINS_I2S_RX_FS_PORT PORTA          /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_I2S_RX_FS_PIN 16U             /*!<@brief PORTA pin index: 16 */
#define BOARD_INITPINS_I2S_RX_FS_PIN_NAME I2S0_RX_FS /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_RX_FS_LABEL "I2S_RX_FS"   /*!<@brief Label */
#define BOARD_INITPINS_I2S_RX_FS_NAME "I2S_RX_FS"    /*!<@brief Identifier name */
                                                     /* @} */

/*! @name PORTA17 (coord K11), I2S_MCLK
  @{ */
#define BOARD_INITPINS_I2S_MCLK_PERIPHERAL I2S0    /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_MCLK_SIGNAL MCLK        /*!<@brief I2S0 signal: MCLK */
#define BOARD_INITPINS_I2S_MCLK_PORT PORTA         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_I2S_MCLK_PIN 17U            /*!<@brief PORTA pin index: 17 */
#define BOARD_INITPINS_I2S_MCLK_PIN_NAME I2S0_MCLK /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_MCLK_LABEL "I2S_MCLK"   /*!<@brief Label */
#define BOARD_INITPINS_I2S_MCLK_NAME "I2S_MCLK"    /*!<@brief Identifier name */
                                                   /* @} */

/*! @name PORTA19 (coord M11), K64_XTAL
  @{ */
#define BOARD_INITPINS_K64_XTAL_PERIPHERAL OSC   /*!<@brief Device name: OSC */
#define BOARD_INITPINS_K64_XTAL_SIGNAL XTAL0     /*!<@brief OSC signal: XTAL0 */
#define BOARD_INITPINS_K64_XTAL_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_K64_XTAL_PIN 19U          /*!<@brief PORTA pin index: 19 */
#define BOARD_INITPINS_K64_XTAL_PIN_NAME XTAL0   /*!<@brief Pin name */
#define BOARD_INITPINS_K64_XTAL_LABEL "K64_XTAL" /*!<@brief Label */
#define BOARD_INITPINS_K64_XTAL_NAME "K64_XTAL"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTA24 (coord K12), TOUCH_TXEN
  @{ */
#define BOARD_INITPINS_TOUCH_TXEN_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_TOUCH_TXEN_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_TOUCH_TXEN_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_TOUCH_TXEN_GPIO_PIN 24U                       /*!<@brief PORTA pin index: 24 */
#define BOARD_INITPINS_TOUCH_TXEN_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_TOUCH_TXEN_PIN 24U                            /*!<@brief PORTA pin index: 24 */
#define BOARD_INITPINS_TOUCH_TXEN_CHANNEL 24                         /*!<@brief GPIOA GPIO channel: 24 */
#define BOARD_INITPINS_TOUCH_TXEN_PIN_NAME PTA24                     /*!<@brief Pin name */
#define BOARD_INITPINS_TOUCH_TXEN_LABEL "TOUCH_TXEN"                 /*!<@brief Label */
#define BOARD_INITPINS_TOUCH_TXEN_NAME "TOUCH_TXEN"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_TOUCH_TXEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

/*! @name PORTA25 (coord J12), AUTH_RST
  @{ */
#define BOARD_INITPINS_AUTH_RST_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_AUTH_RST_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_AUTH_RST_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_AUTH_RST_GPIO_PIN 25U                       /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_AUTH_RST_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_AUTH_RST_PIN 25U                            /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_AUTH_RST_CHANNEL 25                         /*!<@brief GPIOA GPIO channel: 25 */
#define BOARD_INITPINS_AUTH_RST_PIN_NAME PTA25                     /*!<@brief Pin name */
#define BOARD_INITPINS_AUTH_RST_LABEL "AUTH_RST"                   /*!<@brief Label */
#define BOARD_INITPINS_AUTH_RST_NAME "AUTH_RST"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_AUTH_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTA26 (coord J11), MB2_RST
  @{ */
#define BOARD_INITPINS_MB2_RST_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_MB2_RST_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_MB2_RST_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_MB2_RST_GPIO_PIN 26U                       /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_MB2_RST_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_MB2_RST_PIN 26U                            /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_MB2_RST_CHANNEL 26                         /*!<@brief GPIOA GPIO channel: 26 */
#define BOARD_INITPINS_MB2_RST_PIN_NAME PTA26                     /*!<@brief Pin name */
#define BOARD_INITPINS_MB2_RST_LABEL "MB2_RST"                    /*!<@brief Label */
#define BOARD_INITPINS_MB2_RST_NAME "MB2_RST"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_MB2_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

