theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTA27 (coord J10), AIR_INTN
  @{ */
#define BOARD_INITPINS_AIR_INTN_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_AIR_INTN_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_AIR_INTN_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_AIR_INTN_GPIO_PIN 27U                      /*!<@brief PORTA pin index: 27 */
#define BOARD_INITPINS_AIR_INTN_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_AIR_INTN_PIN 27U                           /*!<@brief PORTA pin index: 27 */
#define BOARD_INITPINS_AIR_INTN_CHANNEL 27                        /*!<@brief GPIOA GPIO channel: 27 */
#define BOARD_INITPINS_AIR_INTN_PIN_NAME PTA27                    /*!<@brief Pin name */
#define BOARD_INITPINS_AIR_INTN_LABEL "AIR_INTN"                  /*!<@brief Label */
#define BOARD_INITPINS_AIR_INTN_NAME "AIR_INTN"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_AIR_INTN_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTA28 (coord H12), NTAG_FD
  @{ */
#define BOARD_INITPINS_NTAG_FD_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_NTAG_FD_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_NTAG_FD_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_NTAG_FD_GPIO_PIN 28U                      /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_NTAG_FD_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_NTAG_FD_PIN 28U                           /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_NTAG_FD_CHANNEL 28                        /*!<@brief GPIOA GPIO channel: 28 */
#define BOARD_INITPINS_NTAG_FD_PIN_NAME PTA28                    /*!<@brief Pin name */
#define BOARD_INITPINS_NTAG_FD_LABEL "NTAG_FD"                   /*!<@brief Label */
#define BOARD_INITPINS_NTAG_FD_NAME "NTAG_FD"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_NTAG_FD_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTA29 (coord H11), CHG_STATE
  @{ */
#define BOARD_INITPINS_CHG_STATE_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_CHG_STATE_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_CHG_STATE_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_CHG_STATE_GPIO_PIN 29U                      /*!<@brief PORTA pin index: 29 */
#define BOARD_INITPINS_CHG_STATE_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_CHG_STATE_PIN 29U                           /*!<@brief PORTA pin index: 29 */
#define BOARD_INITPINS_CHG_STATE_CHANNEL 29                        /*!<@brief GPIOA GPIO channel: 29 */
#define BOARD_INITPINS_CHG_STATE_PIN_NAME PTA29                    /*!<@brief Pin name */
#define BOARD_INITPINS_CHG_STATE_LABEL "CHG_STATE"                 /*!<@brief Label */
#define BOARD_INITPINS_CHG_STATE_NAME "CHG_STATE"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_CHG_STATE_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTB0 (coord H10), KW41_WAKE_UP
  @{ */
#define BOARD_INITPINS_KW41_WAKE_UP_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_KW41_WAKE_UP_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_KW41_WAKE_UP_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_KW41_WAKE_UP_GPIO_PIN 0U                        /*!<@brief PORTB pin index: 0 */
#define BOARD_INITPINS_KW41_WAKE_UP_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_KW41_WAKE_UP_PIN 0U                             /*!<@brief PORTB pin index: 0 */
#define BOARD_INITPINS_KW41_WAKE_UP_CHANNEL 0                          /*!<@brief GPIOB GPIO channel: 0 */
#define BOARD_INITPINS_KW41_WAKE_UP_PIN_NAME PTB0                      /*!<@brief Pin name */
#define BOARD_INITPINS_KW41_WAKE_UP_LABEL "KW41_WAKE_UP"               /*!<@brief Label */
#define BOARD_INITPINS_KW41_WAKE_UP_NAME "KW41_WAKE_UP"                /*!<@brief Identifier name */
#define BOARD_INITPINS_KW41_WAKE_UP_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTB1 (coord H9), MB3_PWM
  @{ */
#define BOARD_INITPINS_MB3_PWM_PERIPHERAL FTM1                    /*!<@brief Device name: FTM1 */
#define BOARD_INITPINS_MB3_PWM_SIGNAL CH                          /*!<@brief FTM1 signal: CH */
#define BOARD_INITPINS_MB3_PWM_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MB3_PWM_PIN 1U                             /*!<@brief PORTB pin index: 1 */
#define BOARD_INITPINS_MB3_PWM_CHANNEL 1                          /*!<@brief FTM1 channel: 1 */
#define BOARD_INITPINS_MB3_PWM_PIN_NAME FTM1_CH1                  /*!<@brief Pin name */
#define BOARD_INITPINS_MB3_PWM_LABEL "MB3_PWM"                    /*!<@brief Label */
#define BOARD_INITPINS_MB3_PWM_NAME "MB3_PWM"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_MB3_PWM_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTB2 (coord G12), I2C0_SCL
  @{ */
#define BOARD_INITPINS_I2C0_SCL_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_I2C0_SCL_SIGNAL SCL        /*!<@brief I2C0 signal: SCL */
#define BOARD_INITPINS_I2C0_SCL_PORT PORTB        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_I2C0_SCL_PIN 2U            /*!<@brief PORTB pin index: 2 */
#define BOARD_INITPINS_I2C0_SCL_PIN_NAME I2C0_SCL /*!<@brief Pin name */
#define BOARD_INITPINS_I2C0_SCL_LABEL "I2C0_SCL"  /*!<@brief Label */
#define BOARD_INITPINS_I2C0_SCL_NAME "I2C0_SCL"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTB3 (coord G11), I2C0_SDA
  @{ */
#define BOARD_INITPINS_I2C0_SDA_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_I2C0_SDA_SIGNAL SDA        /*!<@brief I2C0 signal: SDA */
#define BOARD_INITPINS_I2C0_SDA_PORT PORTB        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_I2C0_SDA_PIN 3U            /*!<@brief PORTB pin index: 3 */
#define BOARD_INITPINS_I2C0_SDA_PIN_NAME I2C0_SDA /*!<@brief Pin name */
#define BOARD_INITPINS_I2C0_SDA_LABEL "I2C0_SDA"  /*!<@brief Label */
#define BOARD_INITPINS_I2C0_SDA_NAME "I2C0_SDA"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTB4 (coord G10), MB1_INT
  @{ */
#define BOARD_INITPINS_MB1_INT_PERIPHERAL GPIOB                  /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_MB1_INT_SIGNAL GPIO                       /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_MB1_INT_GPIO GPIOB                        /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MB1_INT_GPIO_PIN 4U                       /*!<@brief PORTB pin index: 4 */
#define BOARD_INITPINS_MB1_INT_PORT PORTB                        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MB1_INT_PIN 4U                            /*!<@brief PORTB pin index: 4 */
#define BOARD_INITPINS_MB1_INT_CHANNEL 4                         /*!<@brief GPIOB GPIO channel: 4 */
#define BOARD_INITPINS_MB1_INT_PIN_NAME PTB4                     /*!<@brief Pin name */
#define BOARD_INITPINS_MB1_INT_LABEL "MB1_INT"                   /*!<@brief Label */
#define BOARD_INITPINS_MB1_INT_NAME "MB1_INT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_MB1_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTB6 (coord F12), MB3_AN
  @{ */
#define BOARD_INITPINS_MB3_AN_PERIPHERAL ADC1    /*!<@brief Device name: ADC1 */
#define BOARD_INITPINS_MB3_AN_SIGNAL SE          /*!<@brief ADC1 signal: SE */
#define BOARD_INITPINS_MB3_AN_PORT PORTB         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MB3_AN_PIN 6U             /*!<@brief PORTB pin index: 6 */
#define BOARD_INITPINS_MB3_AN_CHANNEL 12         /*!<@brief ADC1 SE channel: 12 */
#define BOARD_INITPINS_MB3_AN_PIN_NAME ADC1_SE12 /*!<@brief Pin name */
#define BOARD_INITPINS_MB3_AN_LABEL "MB3_AN"     /*!<@brief Label */
#define BOARD_INITPINS_MB3_AN_NAME "MB3_AN"      /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTB7 (coord F11), MB3_INT
  @{ */
#define BOARD_INITPINS_MB3_INT_PERIPHERAL GPIOB                  /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_MB3_INT_SIGNAL GPIO                       /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_MB3_INT_GPIO GPIOB                        /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MB3_INT_GPIO_PIN 7U                       /*!<@brief PORTB pin index: 7 */
#define BOARD_INITPINS_MB3_INT_PORT PORTB                        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MB3_INT_PIN 7U                            /*!<@brief PORTB pin index: 7 */
#define BOARD_INITPINS_MB3_INT_CHANNEL 7                         /*!<@brief GPIOB GPIO channel: 7 */
#define BOARD_INITPINS_MB3_INT_PIN_NAME PTB7                     /*!<@brief Pin name */
#define BOARD_INITPINS_MB3_INT_LABEL "MB3_INT"                   /*!<@brief Label */
#define BOARD_INITPINS_MB3_INT_NAME "MB3_INT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_MB3_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTB8 (coord F10), MB2_INT
  @{ */
#define BOARD_INITPINS_MB2_INT_PERIPHERAL GPIOB                  /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_MB2_INT_SIGNAL GPIO                       /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_MB2_INT_GPIO GPIOB                        /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MB2_INT_GPIO_PIN 8U                       /*!<@brief PORTB pin index: 8 */
#define BOARD_INITPINS_MB2_INT_PORT PORTB                        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MB2_INT_PIN 8U                            /*!<@brief PORTB pin index: 8 */
#define BOARD_INITPINS_MB2_INT_CHANNEL 8                         /*!<@brief GPIOB GPIO channel: 8 */
#define BOARD_INITPINS_MB2_INT_PIN_NAME PTB8                     /*!<@brief Pin name */
#define BOARD_INITPINS_MB2_INT_LABEL "MB2_INT"                   /*!<@brief Label */
#define BOARD_INITPINS_MB2_INT_NAME "MB2_INT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_MB2_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTB9 (coord F9), SPI1_PCS1
  @{ */
#define BOARD_INITPINS_SPI1_PCS1_PERIPHERAL SPI1    /*!<@brief Device name: SPI1 */
#define BOARD_INITPINS_SPI1_PCS1_SIGNAL PCS1        /*!<@brief SPI1 signal: PCS1 */
#define BOARD_INITPINS_SPI1_PCS1_PORT PORTB         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_SPI1_PCS1_PIN 9U             /*!<@brief PORTB pin index: 9 */
#define BOARD_INITPINS_SPI1_PCS1_PIN_NAME SPI1_PCS1 /*!<@brief Pin name */
#define BOARD_INITPINS_SPI1_PCS1_LABEL "SPI1_PCS1"  /*!<@brief Label */
#define BOARD_INITPINS_SPI1_PCS1_NAME "SPI1_PCS1"   /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTB10 (coord E12), MB3_RST
  @{ */
#define BOARD_INITPINS_MB3_RST_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_MB3_RST_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_MB3_RST_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MB3_RST_GPIO_PIN 10U                       /*!<@brief PORTB pin index: 10 */
#define BOARD_INITPINS_MB3_RST_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MB3_RST_PIN 10U                            /*!<@brief PORTB pin index: 10 */
#define BOARD_INITPINS_MB3_RST_CHANNEL 10                         /*!<@brief GPIOB GPIO channel: 10 */
#define BOARD_INITPINS_MB3_RST_PIN_NAME PTB10                     /*!<@brief Pin name */
#define BOARD_INITPINS_MB3_RST_LABEL "MB3_RST"                    /*!<@brief Label */
#define BOARD_INITPINS_MB3_RST_NAME "MB3_RST"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_MB3_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTB11 (coord E11), MB1_RST
  @{ */
#define BOARD_INITPINS_MB1_RST_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_MB1_RST_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_MB1_RST_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MB1_RST_GPIO_PIN 11U                       /*!<@brief PORTB pin index: 11 */
#define BOARD_INITPINS_MB1_RST_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MB1_RST_PIN 11U                            /*!<@brief PORTB pin index: 11 */
#define BOARD_INITPINS_MB1_RST_CHANNEL 11                         /*!<@brief GPIOB GPIO channel: 11 */
#define BOARD_INITPINS_MB1_RST_PIN_NAME PTB11                     /*!<@brief Pin name */
#define BOARD_INITPINS_MB1_RST_LABEL "MB1_RST"                    /*!<@brief Label */
#define BOARD_INITPINS_MB1_RST_NAME "MB1_RST"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_MB1_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTB16 (coord E10), UART_DBG_RX
  @{ */
#define BOARD_INITPINS_UART_DBG_RX_PERIPHERAL UART0    /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_UART_DBG_RX_SIGNAL RX           /*!<@brief UART0 signal: RX */
#define BOARD_INITPINS_UART_DBG_RX_PORT PORTB          /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_UART_DBG_RX_PIN 16U             /*!<@brief PORTB pin index: 16 */
#define BOARD_INITPINS_UART_DBG_RX_PIN_NAME UART0_RX   /*!<@brief Pin name */
#define BOARD_INITPINS_UART_DBG_RX_LABEL "UART_DBG_RX" /*!<@brief Label */
#define BOARD_INITPINS_UART_DBG_RX_NAME "UART_DBG_RX"  /*!<@brief Identifier name */
                                                       /* @} */

