theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTB17 (coord E9), UART_DBG_TX
  @{ */
#define BOARD_INITPINS_UART_DBG_TX_PERIPHERAL UART0                   /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_UART_DBG_TX_SIGNAL TX                          /*!<@brief UART0 signal: TX */
#define BOARD_INITPINS_UART_DBG_TX_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_UART_DBG_TX_PIN 17U                            /*!<@brief PORTB pin index: 17 */
#define BOARD_INITPINS_UART_DBG_TX_PIN_NAME UART0_TX                  /*!<@brief Pin name */
#define BOARD_INITPINS_UART_DBG_TX_LABEL "UART_DBG_TX"                /*!<@brief Label */
#define BOARD_INITPINS_UART_DBG_TX_NAME "UART_DBG_TX"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_UART_DBG_TX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*! @name PORTB18 (coord D12), CAN_TX
  @{ */
#define BOARD_INITPINS_CAN_TX_PERIPHERAL CAN0  /*!<@brief Device name: CAN0 */
#define BOARD_INITPINS_CAN_TX_SIGNAL TX        /*!<@brief CAN0 signal: TX */
#define BOARD_INITPINS_CAN_TX_PORT PORTB       /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_CAN_TX_PIN 18U          /*!<@brief PORTB pin index: 18 */
#define BOARD_INITPINS_CAN_TX_PIN_NAME CAN0_TX /*!<@brief Pin name */
#define BOARD_INITPINS_CAN_TX_LABEL "CAN_TX"   /*!<@brief Label */
#define BOARD_INITPINS_CAN_TX_NAME "CAN_TX"    /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTB19 (coord D11), CAN_RX
  @{ */
#define BOARD_INITPINS_CAN_RX_PERIPHERAL CAN0  /*!<@brief Device name: CAN0 */
#define BOARD_INITPINS_CAN_RX_SIGNAL RX        /*!<@brief CAN0 signal: RX */
#define BOARD_INITPINS_CAN_RX_PORT PORTB       /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_CAN_RX_PIN 19U          /*!<@brief PORTB pin index: 19 */
#define BOARD_INITPINS_CAN_RX_PIN_NAME CAN0_RX /*!<@brief Pin name */
#define BOARD_INITPINS_CAN_RX_LABEL "CAN_RX"   /*!<@brief Label */
#define BOARD_INITPINS_CAN_RX_NAME "CAN_RX"    /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTB23 (coord C11), KW41_RST
  @{ */
#define BOARD_INITPINS_KW41_RST_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_KW41_RST_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_KW41_RST_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_KW41_RST_GPIO_PIN 23U                       /*!<@brief PORTB pin index: 23 */
#define BOARD_INITPINS_KW41_RST_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_KW41_RST_PIN 23U                            /*!<@brief PORTB pin index: 23 */
#define BOARD_INITPINS_KW41_RST_CHANNEL 23                         /*!<@brief GPIOB GPIO channel: 23 */
#define BOARD_INITPINS_KW41_RST_PIN_NAME PTB23                     /*!<@brief Pin name */
#define BOARD_INITPINS_KW41_RST_LABEL "KW41_RST"                   /*!<@brief Label */
#define BOARD_INITPINS_KW41_RST_NAME "KW41_RST"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_KW41_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTC0 (coord B12), AMB_INT
  @{ */
#define BOARD_INITPINS_AMB_INT_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_AMB_INT_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_AMB_INT_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_AMB_INT_GPIO_PIN 0U                       /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_AMB_INT_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_AMB_INT_PIN 0U                            /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_AMB_INT_CHANNEL 0                         /*!<@brief GPIOC GPIO channel: 0 */
#define BOARD_INITPINS_AMB_INT_PIN_NAME PTC0                     /*!<@brief Pin name */
#define BOARD_INITPINS_AMB_INT_LABEL "AMB_INT"                   /*!<@brief Label */
#define BOARD_INITPINS_AMB_INT_NAME "AMB_INT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_AMB_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTC1 (coord B11), ACCEL_INT1
  @{ */
#define BOARD_INITPINS_ACCEL_INT1_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ACCEL_INT1_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ACCEL_INT1_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ACCEL_INT1_GPIO_PIN 1U                       /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_ACCEL_INT1_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ACCEL_INT1_PIN 1U                            /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_ACCEL_INT1_CHANNEL 1                         /*!<@brief GPIOC GPIO channel: 1 */
#define BOARD_INITPINS_ACCEL_INT1_PIN_NAME PTC1                     /*!<@brief Pin name */
#define BOARD_INITPINS_ACCEL_INT1_LABEL "ACCEL_INT1"                /*!<@brief Label */
#define BOARD_INITPINS_ACCEL_INT1_NAME "ACCEL_INT1"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_ACCEL_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTC2 (coord A12), MB3_SPI_CS
  @{ */
#define BOARD_INITPINS_MB3_SPI_CS_PERIPHERAL SPI0    /*!<@brief Device name: SPI0 */
#define BOARD_INITPINS_MB3_SPI_CS_SIGNAL PCS2        /*!<@brief SPI0 signal: PCS2 */
#define BOARD_INITPINS_MB3_SPI_CS_PORT PORTC         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_MB3_SPI_CS_PIN 2U             /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_MB3_SPI_CS_PIN_NAME SPI0_PCS2 /*!<@brief Pin name */
#define BOARD_INITPINS_MB3_SPI_CS_LABEL "MB3_SPI_CS" /*!<@brief Label */
#define BOARD_INITPINS_MB3_SPI_CS_NAME "MB3_SPI_CS"  /*!<@brief Identifier name */
                                                     /* @} */

/*! @name PORTC3 (coord A11), MB2_SPI_CS
  @{ */
#define BOARD_INITPINS_MB2_SPI_CS_PERIPHERAL SPI0    /*!<@brief Device name: SPI0 */
#define BOARD_INITPINS_MB2_SPI_CS_SIGNAL PCS1        /*!<@brief SPI0 signal: PCS1 */
#define BOARD_INITPINS_MB2_SPI_CS_PORT PORTC         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_MB2_SPI_CS_PIN 3U             /*!<@brief PORTC pin index: 3 */
#define BOARD_INITPINS_MB2_SPI_CS_PIN_NAME SPI0_PCS1 /*!<@brief Pin name */
#define BOARD_INITPINS_MB2_SPI_CS_LABEL "MB2_SPI_CS" /*!<@brief Label */
#define BOARD_INITPINS_MB2_SPI_CS_NAME "MB2_SPI_CS"  /*!<@brief Identifier name */
                                                     /* @} */

/*! @name PORTC4 (coord A9), MB1_SPI_CS
  @{ */
#define BOARD_INITPINS_MB1_SPI_CS_PERIPHERAL SPI0                    /*!<@brief Device name: SPI0 */
#define BOARD_INITPINS_MB1_SPI_CS_SIGNAL PCS0_SS                     /*!<@brief SPI0 signal: PCS0_SS */
#define BOARD_INITPINS_MB1_SPI_CS_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_MB1_SPI_CS_PIN 4U                             /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_MB1_SPI_CS_PIN_NAME SPI0_PCS0                 /*!<@brief Pin name */
#define BOARD_INITPINS_MB1_SPI_CS_LABEL "MB1_SPI_CS"                 /*!<@brief Label */
#define BOARD_INITPINS_MB1_SPI_CS_NAME "MB1_SPI_CS"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_MB1_SPI_CS_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

/*! @name PORTC5 (coord D8), MB_SPI_SCK
  @{ */
#define BOARD_INITPINS_MB_SPI_SCK_PERIPHERAL SPI0                    /*!<@brief Device name: SPI0 */
#define BOARD_INITPINS_MB_SPI_SCK_SIGNAL SCK                         /*!<@brief SPI0 signal: SCK */
#define BOARD_INITPINS_MB_SPI_SCK_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_MB_SPI_SCK_PIN 5U                             /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_MB_SPI_SCK_PIN_NAME SPI0_SCK                  /*!<@brief Pin name */
#define BOARD_INITPINS_MB_SPI_SCK_LABEL "MB_SPI_SCK"                 /*!<@brief Label */
#define BOARD_INITPINS_MB_SPI_SCK_NAME "MB_SPI_SCK"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_MB_SPI_SCK_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

