theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTC6 (coord C8), MB_SPI_MOSI
  @{ */
#define BOARD_INITPINS_MB_SPI_MOSI_PERIPHERAL SPI0     /*!<@brief Device name: SPI0 */
#define BOARD_INITPINS_MB_SPI_MOSI_SIGNAL SOUT         /*!<@brief SPI0 signal: SOUT */
#define BOARD_INITPINS_MB_SPI_MOSI_PORT PORTC          /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_MB_SPI_MOSI_PIN 6U              /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_MB_SPI_MOSI_PIN_NAME SPI0_SOUT  /*!<@brief Pin name */
#define BOARD_INITPINS_MB_SPI_MOSI_LABEL "MB_SPI_MOSI" /*!<@brief Label */
#define BOARD_INITPINS_MB_SPI_MOSI_NAME "MB_SPI_MOSI"  /*!<@brief Identifier name */
                                                       /* @} */

/*! @name PORTC7 (coord B8), MB_SPI_MISO
  @{ */
#define BOARD_INITPINS_MB_SPI_MISO_PERIPHERAL SPI0     /*!<@brief Device name: SPI0 */
#define BOARD_INITPINS_MB_SPI_MISO_SIGNAL SIN          /*!<@brief SPI0 signal: SIN */
#define BOARD_INITPINS_MB_SPI_MISO_PORT PORTC          /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_MB_SPI_MISO_PIN 7U              /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_MB_SPI_MISO_PIN_NAME SPI0_SIN   /*!<@brief Pin name */
#define BOARD_INITPINS_MB_SPI_MISO_LABEL "MB_SPI_MISO" /*!<@brief Label */
#define BOARD_INITPINS_MB_SPI_MISO_NAME "MB_SPI_MISO"  /*!<@brief Identifier name */
                                                       /* @} */

/*! @name PORTC10 (coord C7), I2C1_SCL
  @{ */
#define BOARD_INITPINS_I2C1_SCL_PERIPHERAL I2C1   /*!<@brief Device name: I2C1 */
#define BOARD_INITPINS_I2C1_SCL_SIGNAL SCL        /*!<@brief I2C1 signal: SCL */
#define BOARD_INITPINS_I2C1_SCL_PORT PORTC        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_I2C1_SCL_PIN 10U           /*!<@brief PORTC pin index: 10 */
#define BOARD_INITPINS_I2C1_SCL_PIN_NAME I2C1_SCL /*!<@brief Pin name */
#define BOARD_INITPINS_I2C1_SCL_LABEL "I2C1_SCL"  /*!<@brief Label */
#define BOARD_INITPINS_I2C1_SCL_NAME "I2C1_SCL"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTC11 (coord B7), I2C1_SDA
  @{ */
#define BOARD_INITPINS_I2C1_SDA_PERIPHERAL I2C1   /*!<@brief Device name: I2C1 */
#define BOARD_INITPINS_I2C1_SDA_SIGNAL SDA        /*!<@brief I2C1 signal: SDA */
#define BOARD_INITPINS_I2C1_SDA_PORT PORTC        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_I2C1_SDA_PIN 11U           /*!<@brief PORTC pin index: 11 */
#define BOARD_INITPINS_I2C1_SDA_PIN_NAME I2C1_SDA /*!<@brief Pin name */
#define BOARD_INITPINS_I2C1_SDA_LABEL "I2C1_SDA"  /*!<@brief Label */
#define BOARD_INITPINS_I2C1_SDA_NAME "I2C1_SDA"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTC12 (coord A7), NTAG_EN
  @{ */
#define BOARD_INITPINS_NTAG_EN_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_NTAG_EN_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_NTAG_EN_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_NTAG_EN_GPIO_PIN 12U                       /*!<@brief PORTC pin index: 12 */
#define BOARD_INITPINS_NTAG_EN_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_NTAG_EN_PIN 12U                            /*!<@brief PORTC pin index: 12 */
#define BOARD_INITPINS_NTAG_EN_CHANNEL 12                         /*!<@brief GPIOC GPIO channel: 12 */
#define BOARD_INITPINS_NTAG_EN_PIN_NAME PTC12                     /*!<@brief Pin name */
#define BOARD_INITPINS_NTAG_EN_LABEL "NTAG_EN"                    /*!<@brief Label */
#define BOARD_INITPINS_NTAG_EN_NAME "NTAG_EN"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_NTAG_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTC13 (coord D6), KW41_PB18
  @{ */
#define BOARD_INITPINS_KW41_PB18_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_KW41_PB18_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_KW41_PB18_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_KW41_PB18_GPIO_PIN 13U                      /*!<@brief PORTC pin index: 13 */
#define BOARD_INITPINS_KW41_PB18_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_KW41_PB18_PIN 13U                           /*!<@brief PORTC pin index: 13 */
#define BOARD_INITPINS_KW41_PB18_CHANNEL 13                        /*!<@brief GPIOC GPIO channel: 13 */
#define BOARD_INITPINS_KW41_PB18_PIN_NAME PTC13                    /*!<@brief Pin name */
#define BOARD_INITPINS_KW41_PB18_LABEL "KW41_PB18"                 /*!<@brief Label */
#define BOARD_INITPINS_KW41_PB18_NAME "KW41_PB18"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_KW41_PB18_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTC14 (coord C6), BAT_SENS_EN
  @{ */
#define BOARD_INITPINS_BAT_SENS_EN_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_BAT_SENS_EN_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_BAT_SENS_EN_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_BAT_SENS_EN_GPIO_PIN 14U                       /*!<@brief PORTC pin index: 14 */
#define BOARD_INITPINS_BAT_SENS_EN_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_BAT_SENS_EN_PIN 14U                            /*!<@brief PORTC pin index: 14 */
#define BOARD_INITPINS_BAT_SENS_EN_CHANNEL 14                         /*!<@brief GPIOC GPIO channel: 14 */
#define BOARD_INITPINS_BAT_SENS_EN_PIN_NAME PTC14                     /*!<@brief Pin name */
#define BOARD_INITPINS_BAT_SENS_EN_LABEL "BAT_SENS_EN"                /*!<@brief Label */
#define BOARD_INITPINS_BAT_SENS_EN_NAME "BAT_SENS_EN"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_BAT_SENS_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*! @name PORTC15 (coord B6), GYRO_RST
  @{ */
#define BOARD_INITPINS_GYRO_RST_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_GYRO_RST_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_GYRO_RST_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_GYRO_RST_GPIO_PIN 15U                       /*!<@brief PORTC pin index: 15 */
#define BOARD_INITPINS_GYRO_RST_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_GYRO_RST_PIN 15U                            /*!<@brief PORTC pin index: 15 */
#define BOARD_INITPINS_GYRO_RST_CHANNEL 15                         /*!<@brief GPIOC GPIO channel: 15 */
#define BOARD_INITPINS_GYRO_RST_PIN_NAME PTC15                     /*!<@brief Pin name */
#define BOARD_INITPINS_GYRO_RST_LABEL "GYRO_RST"                   /*!<@brief Label */
#define BOARD_INITPINS_GYRO_RST_NAME "GYRO_RST"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_GYRO_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTC16 (coord A6), UART3_RX
  @{ */
#define BOARD_INITPINS_UART3_RX_PERIPHERAL UART3  /*!<@brief Device name: UART3 */
#define BOARD_INITPINS_UART3_RX_SIGNAL RX         /*!<@brief UART3 signal: RX */
#define BOARD_INITPINS_UART3_RX_PORT PORTC        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_UART3_RX_PIN 16U           /*!<@brief PORTC pin index: 16 */
#define BOARD_INITPINS_UART3_RX_PIN_NAME UART3_RX /*!<@brief Pin name */
#define BOARD_INITPINS_UART3_RX_LABEL "UART3_RX"  /*!<@brief Label */
#define BOARD_INITPINS_UART3_RX_NAME "UART3_RX"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTC17 (coord D5), UART3_TX
  @{ */
#define BOARD_INITPINS_UART3_TX_PERIPHERAL UART3                   /*!<@brief Device name: UART3 */
#define BOARD_INITPINS_UART3_TX_SIGNAL TX                          /*!<@brief UART3 signal: TX */
#define BOARD_INITPINS_UART3_TX_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_UART3_TX_PIN 17U                            /*!<@brief PORTC pin index: 17 */
#define BOARD_INITPINS_UART3_TX_PIN_NAME UART3_TX                  /*!<@brief Pin name */
#define BOARD_INITPINS_UART3_TX_LABEL "UART3_TX"                   /*!<@brief Label */
#define BOARD_INITPINS_UART3_TX_NAME "UART3_TX"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_UART3_TX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTC18 (coord C5), GYRO_INT2
  @{ */
#define BOARD_INITPINS_GYRO_INT2_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_GYRO_INT2_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_GYRO_INT2_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_GYRO_INT2_GPIO_PIN 18U                      /*!<@brief PORTC pin index: 18 */
#define BOARD_INITPINS_GYRO_INT2_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_GYRO_INT2_PIN 18U                           /*!<@brief PORTC pin index: 18 */
#define BOARD_INITPINS_GYRO_INT2_CHANNEL 18                        /*!<@brief GPIOC GPIO channel: 18 */
#define BOARD_INITPINS_GYRO_INT2_PIN_NAME PTC18                    /*!<@brief Pin name */
#define BOARD_INITPINS_GYRO_INT2_LABEL "GYRO_INT2"                 /*!<@brief Label */
#define BOARD_INITPINS_GYRO_INT2_NAME "GYRO_INT2"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_GYRO_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTC19 (coord B5), USB_VBUS
  @{ */
#define BOARD_INITPINS_USB_VBUS_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_USB_VBUS_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_USB_VBUS_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_USB_VBUS_GPIO_PIN 19U                      /*!<@brief PORTC pin index: 19 */
#define BOARD_INITPINS_USB_VBUS_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_USB_VBUS_PIN 19U                           /*!<@brief PORTC pin index: 19 */
#define BOARD_INITPINS_USB_VBUS_CHANNEL 19                        /*!<@brief GPIOC GPIO channel: 19 */
#define BOARD_INITPINS_USB_VBUS_PIN_NAME PTC19                    /*!<@brief Pin name */
#define BOARD_INITPINS_USB_VBUS_LABEL "USB_VBUS"                  /*!<@brief Label */
#define BOARD_INITPINS_USB_VBUS_NAME "USB_VBUS"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_USB_VBUS_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name RESET_b (coord L12), K64_RST
  @{ */
#define BOARD_INITPINS_K64_RST_PERIPHERAL RCM   /*!<@brief Device name: RCM */
#define BOARD_INITPINS_K64_RST_SIGNAL RESET     /*!<@brief RCM signal: RESET */
#define BOARD_INITPINS_K64_RST_PIN_NAME RESET_b /*!<@brief Pin name */
#define BOARD_INITPINS_K64_RST_LABEL "K64_RST"  /*!<@brief Label */
#define BOARD_INITPINS_K64_RST_NAME "K64_RST"   /*!<@brief Identifier name */
                                                /* @} */

/*! @name PORTD0 (coord A5), RTC_INT
  @{ */
#define BOARD_INITPINS_RTC_INT_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_RTC_INT_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_RTC_INT_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_RTC_INT_GPIO_PIN 0U                       /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_RTC_INT_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_RTC_INT_PIN 0U                            /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_RTC_INT_CHANNEL 0                         /*!<@brief GPIOD GPIO channel: 0 */
#define BOARD_INITPINS_RTC_INT_PIN_NAME PTD0                     /*!<@brief Pin name */
#define BOARD_INITPINS_RTC_INT_LABEL "RTC_INT"                   /*!<@brief Label */
#define BOARD_INITPINS_RTC_INT_NAME "RTC_INT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_RTC_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTD1 (coord D4), GYRO_INT1
  @{ */
#define BOARD_INITPINS_GYRO_INT1_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_GYRO_INT1_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_GYRO_INT1_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_GYRO_INT1_GPIO_PIN 1U                       /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_GYRO_INT1_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_GYRO_INT1_PIN 1U                            /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_GYRO_INT1_CHANNEL 1                         /*!<@brief GPIOD GPIO channel: 1 */
#define BOARD_INITPINS_GYRO_INT1_PIN_NAME PTD1                     /*!<@brief Pin name */
#define BOARD_INITPINS_GYRO_INT1_LABEL "GYRO_INT1"                 /*!<@brief Label */
#define BOARD_INITPINS_GYRO_INT1_NAME "GYRO_INT1"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_GYRO_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTD2 (coord C4), UART2_RX
  @{ */
#define BOARD_INITPINS_UART2_RX_PERIPHERAL UART2  /*!<@brief Device name: UART2 */
#define BOARD_INITPINS_UART2_RX_SIGNAL RX         /*!<@brief UART2 signal: RX */
#define BOARD_INITPINS_UART2_RX_PORT PORTD        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_UART2_RX_PIN 2U            /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_UART2_RX_PIN_NAME UART2_RX /*!<@brief Pin name */
#define BOARD_INITPINS_UART2_RX_LABEL "UART2_RX"  /*!<@brief Label */
#define BOARD_INITPINS_UART2_RX_NAME "UART2_RX"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTD3 (coord B4), UART2_TX
  @{ */
#define BOARD_INITPINS_UART2_TX_PERIPHERAL UART2                   /*!<@brief Device name: UART2 */
#define BOARD_INITPINS_UART2_TX_SIGNAL TX                          /*!<@brief UART2 signal: TX */
#define BOARD_INITPINS_UART2_TX_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_UART2_TX_PIN 3U                             /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_UART2_TX_PIN_NAME UART2_TX                  /*!<@brief Pin name */
#define BOARD_INITPINS_UART2_TX_LABEL "UART2_TX"                   /*!<@brief Label */
#define BOARD_INITPINS_UART2_TX_NAME "UART2_TX"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_UART2_TX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTD4 (coord A4), SPI1_PCS0
  @{ */
#define BOARD_INITPINS_SPI1_PCS0_PERIPHERAL SPI1                    /*!<@brief Device name: SPI1 */
#define BOARD_INITPINS_SPI1_PCS0_SIGNAL PCS0_SS                     /*!<@brief SPI1 signal: PCS0_SS */
#define BOARD_INITPINS_SPI1_PCS0_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_SPI1_PCS0_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI1_PCS0_PIN 4U                             /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_SPI1_PCS0_PIN_NAME SPI1_PCS0                 /*!<@brief Pin name */
#define BOARD_INITPINS_SPI1_PCS0_LABEL "SPI1_PCS0"                  /*!<@brief Label */
#define BOARD_INITPINS_SPI1_PCS0_NAME "SPI1_PCS0"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_SPI1_PCS0_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTD5 (coord A3), SPI1_SCK
  @{ */
#define BOARD_INITPINS_SPI1_SCK_PERIPHERAL SPI1                    /*!<@brief Device name: SPI1 */
#define BOARD_INITPINS_SPI1_SCK_SIGNAL SCK                         /*!<@brief SPI1 signal: SCK */
#define BOARD_INITPINS_SPI1_SCK_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI1_SCK_PIN 5U                             /*!<@brief PORTD pin index: 5 */
#define BOARD_INITPINS_SPI1_SCK_PIN_NAME SPI1_SCK                  /*!<@brief Pin name */
#define BOARD_INITPINS_SPI1_SCK_LABEL "SPI1_SCK"                   /*!<@brief Label */
#define BOARD_INITPINS_SPI1_SCK_NAME "SPI1_SCK"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_SPI1_SCK_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

