theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTD6 (coord A2), SPI1_MOSI
  @{ */
#define BOARD_INITPINS_SPI1_MOSI_PERIPHERAL SPI1    /*!<@brief Device name: SPI1 */
#define BOARD_INITPINS_SPI1_MOSI_SIGNAL SOUT        /*!<@brief SPI1 signal: SOUT */
#define BOARD_INITPINS_SPI1_MOSI_PORT PORTD         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI1_MOSI_PIN 6U             /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_SPI1_MOSI_PIN_NAME SPI1_SOUT /*!<@brief Pin name */
#define BOARD_INITPINS_SPI1_MOSI_LABEL "SPI1_MOSI"  /*!<@brief Label */
#define BOARD_INITPINS_SPI1_MOSI_NAME "SPI1_MOSI"   /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTD9 (coord B9), DISP_EN
  @{ */
#define BOARD_INITPINS_DISP_EN_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_DISP_EN_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_DISP_EN_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_DISP_EN_GPIO_PIN 9U                        /*!<@brief PORTD pin index: 9 */
#define BOARD_INITPINS_DISP_EN_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_DISP_EN_PIN 9U                             /*!<@brief PORTD pin index: 9 */
#define BOARD_INITPINS_DISP_EN_CHANNEL 9                          /*!<@brief GPIOD GPIO channel: 9 */
#define BOARD_INITPINS_DISP_EN_PIN_NAME PTD9                      /*!<@brief Pin name */
#define BOARD_INITPINS_DISP_EN_LABEL "DISP_EN"                    /*!<@brief Label */
#define BOARD_INITPINS_DISP_EN_NAME "DISP_EN"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_DISP_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTD10 (coord B3), PRESSURE_INT2
  @{ */
#define BOARD_INITPINS_PRESSURE_INT2_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PRESSURE_INT2_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PRESSURE_INT2_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PRESSURE_INT2_GPIO_PIN 10U                      /*!<@brief PORTD pin index: 10 */
#define BOARD_INITPINS_PRESSURE_INT2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PRESSURE_INT2_PIN 10U                           /*!<@brief PORTD pin index: 10 */
#define BOARD_INITPINS_PRESSURE_INT2_CHANNEL 10                        /*!<@brief GPIOD GPIO channel: 10 */
#define BOARD_INITPINS_PRESSURE_INT2_PIN_NAME PTD10                    /*!<@brief Pin name */
#define BOARD_INITPINS_PRESSURE_INT2_LABEL "PRESSURE_INT2"             /*!<@brief Label */
#define BOARD_INITPINS_PRESSURE_INT2_NAME "PRESSURE_INT2"              /*!<@brief Identifier name */
#define BOARD_INITPINS_PRESSURE_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTD11 (coord B2), ACCEL_RST
  @{ */
#define BOARD_INITPINS_ACCEL_RST_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_ACCEL_RST_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_ACCEL_RST_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_ACCEL_RST_GPIO_PIN 11U                       /*!<@brief PORTD pin index: 11 */
#define BOARD_INITPINS_ACCEL_RST_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_ACCEL_RST_PIN 11U                            /*!<@brief PORTD pin index: 11 */
#define BOARD_INITPINS_ACCEL_RST_CHANNEL 11                         /*!<@brief GPIOD GPIO channel: 11 */
#define BOARD_INITPINS_ACCEL_RST_PIN_NAME PTD11                     /*!<@brief Pin name */
#define BOARD_INITPINS_ACCEL_RST_LABEL "ACCEL_RST"                  /*!<@brief Label */
#define BOARD_INITPINS_ACCEL_RST_NAME "ACCEL_RST"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_ACCEL_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTD12 (coord B1), PRESSURE_INT1
  @{ */
#define BOARD_INITPINS_PRESSURE_INT1_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PRESSURE_INT1_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PRESSURE_INT1_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PRESSURE_INT1_GPIO_PIN 12U                      /*!<@brief PORTD pin index: 12 */
#define BOARD_INITPINS_PRESSURE_INT1_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PRESSURE_INT1_PIN 12U                           /*!<@brief PORTD pin index: 12 */
#define BOARD_INITPINS_PRESSURE_INT1_CHANNEL 12                        /*!<@brief GPIOD GPIO channel: 12 */
#define BOARD_INITPINS_PRESSURE_INT1_PIN_NAME PTD12                    /*!<@brief Pin name */
#define BOARD_INITPINS_PRESSURE_INT1_LABEL "PRESSURE_INT1"             /*!<@brief Label */
#define BOARD_INITPINS_PRESSURE_INT1_NAME "PRESSURE_INT1"              /*!<@brief Identifier name */
#define BOARD_INITPINS_PRESSURE_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTD13 (coord C3), ACCEL_INT2
  @{ */
#define BOARD_INITPINS_ACCEL_INT2_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_ACCEL_INT2_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_ACCEL_INT2_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_ACCEL_INT2_GPIO_PIN 13U                      /*!<@brief PORTD pin index: 13 */
#define BOARD_INITPINS_ACCEL_INT2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_ACCEL_INT2_PIN 13U                           /*!<@brief PORTD pin index: 13 */
#define BOARD_INITPINS_ACCEL_INT2_CHANNEL 13                        /*!<@brief GPIOD GPIO channel: 13 */
#define BOARD_INITPINS_ACCEL_INT2_PIN_NAME PTD13                    /*!<@brief Pin name */
#define BOARD_INITPINS_ACCEL_INT2_LABEL "ACCEL_INT2"                /*!<@brief Label */
#define BOARD_INITPINS_ACCEL_INT2_NAME "ACCEL_INT2"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_ACCEL_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTD14 (coord C2), RTC_CLKOE
  @{ */
#define BOARD_INITPINS_RTC_CLKOE_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_RTC_CLKOE_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_RTC_CLKOE_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_RTC_CLKOE_GPIO_PIN 14U                       /*!<@brief PORTD pin index: 14 */
#define BOARD_INITPINS_RTC_CLKOE_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_RTC_CLKOE_PIN 14U                            /*!<@brief PORTD pin index: 14 */
#define BOARD_INITPINS_RTC_CLKOE_CHANNEL 14                         /*!<@brief GPIOD GPIO channel: 14 */
#define BOARD_INITPINS_RTC_CLKOE_PIN_NAME PTD14                     /*!<@brief Pin name */
#define BOARD_INITPINS_RTC_CLKOE_LABEL "RTC_CLKOE"                  /*!<@brief Label */
#define BOARD_INITPINS_RTC_CLKOE_NAME "RTC_CLKOE"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_RTC_CLKOE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTD15 (coord C1), DISP_DISP
  @{ */
#define BOARD_INITPINS_DISP_DISP_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_DISP_DISP_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_DISP_DISP_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_DISP_DISP_GPIO_PIN 15U                       /*!<@brief PORTD pin index: 15 */
#define BOARD_INITPINS_DISP_DISP_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_DISP_DISP_PIN 15U                            /*!<@brief PORTD pin index: 15 */
#define BOARD_INITPINS_DISP_DISP_CHANNEL 15                         /*!<@brief GPIOD GPIO channel: 15 */
#define BOARD_INITPINS_DISP_DISP_PIN_NAME PTD15                     /*!<@brief Pin name */
#define BOARD_INITPINS_DISP_DISP_LABEL "DISP_DISP"                  /*!<@brief Label */
#define BOARD_INITPINS_DISP_DISP_NAME "DISP_DISP"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_DISP_DISP_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

