theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTE0 (coord D3), SD_D1
  @{ */
#define BOARD_INITPINS_SD_D1_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SD_D1_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SD_D1_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SD_D1_PIN 0U            /*!<@brief PORTE pin index: 0 */
#define BOARD_INITPINS_SD_D1_CHANNEL 1         /*!<@brief SDHC DATA channel: 1 */
#define BOARD_INITPINS_SD_D1_PIN_NAME SDHC0_D1 /*!<@brief Pin name */
#define BOARD_INITPINS_SD_D1_LABEL "SD_D1"     /*!<@brief Label */
#define BOARD_INITPINS_SD_D1_NAME "SD_D1"      /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTE1 (coord D2), SD_D0
  @{ */
#define BOARD_INITPINS_SD_D0_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SD_D0_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SD_D0_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SD_D0_PIN 1U            /*!<@brief PORTE pin index: 1 */
#define BOARD_INITPINS_SD_D0_CHANNEL 0         /*!<@brief SDHC DATA channel: 0 */
#define BOARD_INITPINS_SD_D0_PIN_NAME SDHC0_D0 /*!<@brief Pin name */
#define BOARD_INITPINS_SD_D0_LABEL "SD_D0"     /*!<@brief Label */
#define BOARD_INITPINS_SD_D0_NAME "SD_D0"      /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTE2 (coord D1), SD_CLK
  @{ */
#define BOARD_INITPINS_SD_CLK_PERIPHERAL SDHC     /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SD_CLK_SIGNAL DCLK         /*!<@brief SDHC signal: DCLK */
#define BOARD_INITPINS_SD_CLK_PORT PORTE          /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SD_CLK_PIN 2U              /*!<@brief PORTE pin index: 2 */
#define BOARD_INITPINS_SD_CLK_PIN_NAME SDHC0_DCLK /*!<@brief Pin name */
#define BOARD_INITPINS_SD_CLK_LABEL "SD_CLK"      /*!<@brief Label */
#define BOARD_INITPINS_SD_CLK_NAME "SD_CLK"       /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTE3 (coord E4), SD_CMD
  @{ */
#define BOARD_INITPINS_SD_CMD_PERIPHERAL SDHC    /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SD_CMD_SIGNAL CMD         /*!<@brief SDHC signal: CMD */
#define BOARD_INITPINS_SD_CMD_PORT PORTE         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SD_CMD_PIN 3U             /*!<@brief PORTE pin index: 3 */
#define BOARD_INITPINS_SD_CMD_PIN_NAME SDHC0_CMD /*!<@brief Pin name */
#define BOARD_INITPINS_SD_CMD_LABEL "SD_CMD"     /*!<@brief Label */
#define BOARD_INITPINS_SD_CMD_NAME "SD_CMD"      /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTE4 (coord E3), SD_D3
  @{ */
#define BOARD_INITPINS_SD_D3_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SD_D3_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SD_D3_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SD_D3_PIN 4U            /*!<@brief PORTE pin index: 4 */
#define BOARD_INITPINS_SD_D3_CHANNEL 3         /*!<@brief SDHC DATA channel: 3 */
#define BOARD_INITPINS_SD_D3_PIN_NAME SDHC0_D3 /*!<@brief Pin name */
#define BOARD_INITPINS_SD_D3_LABEL "SD_D3"     /*!<@brief Label */
#define BOARD_INITPINS_SD_D3_NAME "SD_D3"      /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTE5 (coord E2), SD_D2
  @{ */
#define BOARD_INITPINS_SD_D2_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SD_D2_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SD_D2_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SD_D2_PIN 5U            /*!<@brief PORTE pin index: 5 */
#define BOARD_INITPINS_SD_D2_CHANNEL 2         /*!<@brief SDHC DATA channel: 2 */
#define BOARD_INITPINS_SD_D2_PIN_NAME SDHC0_D2 /*!<@brief Pin name */
#define BOARD_INITPINS_SD_D2_LABEL "SD_D2"     /*!<@brief Label */
#define BOARD_INITPINS_SD_D2_NAME "SD_D2"      /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTE6 (coord E1), DISP_EXTCOMIN
  @{ */
#define BOARD_INITPINS_DISP_EXTCOMIN_PERIPHERAL FTM3                    /*!<@brief Device name: FTM3 */
#define BOARD_INITPINS_DISP_EXTCOMIN_SIGNAL CH                          /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_DISP_EXTCOMIN_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_DISP_EXTCOMIN_PIN 6U                             /*!<@brief PORTE pin index: 6 */
#define BOARD_INITPINS_DISP_EXTCOMIN_CHANNEL 1                          /*!<@brief GPIOE GPIO channel: 6 */
#define BOARD_INITPINS_DISP_EXTCOMIN_PIN_NAME FTM3_CH1                  /*!<@brief Pin name */
#define BOARD_INITPINS_DISP_EXTCOMIN_LABEL "DISP_EXTCOMIN"              /*!<@brief Label */
#define BOARD_INITPINS_DISP_EXTCOMIN_NAME "DISP_EXTCOMIN"               /*!<@brief Identifier name */
#define BOARD_INITPINS_DISP_EXTCOMIN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                        /* @} */

/*! @name PORTE9 (coord F2), USER_SW2
  @{ */
#define BOARD_INITPINS_USER_SW2_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_USER_SW2_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_USER_SW2_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_USER_SW2_GPIO_PIN 9U                       /*!<@brief PORTE pin index: 9 */
#define BOARD_INITPINS_USER_SW2_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_USER_SW2_PIN 9U                            /*!<@brief PORTE pin index: 9 */
#define BOARD_INITPINS_USER_SW2_CHANNEL 9                         /*!<@brief GPIOE GPIO channel: 9 */
#define BOARD_INITPINS_USER_SW2_PIN_NAME PTE9                     /*!<@brief Pin name */
#define BOARD_INITPINS_USER_SW2_LABEL "USER_SW2"                  /*!<@brief Label */
#define BOARD_INITPINS_USER_SW2_NAME "USER_SW2"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_USER_SW2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTE10 (coord F1), USER_SW3
  @{ */
#define BOARD_INITPINS_USER_SW3_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_USER_SW3_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_USER_SW3_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_USER_SW3_GPIO_PIN 10U                      /*!<@brief PORTE pin index: 10 */
#define BOARD_INITPINS_USER_SW3_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_USER_SW3_PIN 10U                           /*!<@brief PORTE pin index: 10 */
#define BOARD_INITPINS_USER_SW3_CHANNEL 10                        /*!<@brief GPIOE GPIO channel: 10 */
#define BOARD_INITPINS_USER_SW3_PIN_NAME PTE10                    /*!<@brief Pin name */
#define BOARD_INITPINS_USER_SW3_LABEL "USER_SW3"                  /*!<@brief Label */
#define BOARD_INITPINS_USER_SW3_NAME "USER_SW3"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_USER_SW3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTE11 (coord G4), DISP_EXTMODE
  @{ */
#define BOARD_INITPINS_DISP_EXTMODE_PERIPHERAL GPIOE                   /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_DISP_EXTMODE_SIGNAL GPIO                        /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_DISP_EXTMODE_GPIO GPIOE                         /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_DISP_EXTMODE_GPIO_PIN 11U                       /*!<@brief PORTE pin index: 11 */
#define BOARD_INITPINS_DISP_EXTMODE_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_DISP_EXTMODE_PIN 11U                            /*!<@brief PORTE pin index: 11 */
#define BOARD_INITPINS_DISP_EXTMODE_CHANNEL 11                         /*!<@brief GPIOE GPIO channel: 11 */
#define BOARD_INITPINS_DISP_EXTMODE_PIN_NAME PTE11                     /*!<@brief Pin name */
#define BOARD_INITPINS_DISP_EXTMODE_LABEL "DISP_EXTMODE"               /*!<@brief Label */
#define BOARD_INITPINS_DISP_EXTMODE_NAME "DISP_EXTMODE"                /*!<@brief Identifier name */
#define BOARD_INITPINS_DISP_EXTMODE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTE24 (coord M4), KW41_UART_RX
  @{ */
#define BOARD_INITPINS_KW41_UART_RX_PERIPHERAL UART4                   /*!<@brief Device name: UART4 */
#define BOARD_INITPINS_KW41_UART_RX_SIGNAL TX                          /*!<@brief UART4 signal: TX */
#define BOARD_INITPINS_KW41_UART_RX_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_KW41_UART_RX_PIN 24U                            /*!<@brief PORTE pin index: 24 */
#define BOARD_INITPINS_KW41_UART_RX_PIN_NAME UART4_TX                  /*!<@brief Pin name */
#define BOARD_INITPINS_KW41_UART_RX_LABEL "KW41_UART_RX"               /*!<@brief Label */
#define BOARD_INITPINS_KW41_UART_RX_NAME "KW41_UART_RX"                /*!<@brief Identifier name */
#define BOARD_INITPINS_KW41_UART_RX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTE25 (coord K5), KW41_UART_TX
  @{ */
#define BOARD_INITPINS_KW41_UART_TX_PERIPHERAL UART4     /*!<@brief Device name: UART4 */
#define BOARD_INITPINS_KW41_UART_TX_SIGNAL RX            /*!<@brief UART4 signal: RX */
#define BOARD_INITPINS_KW41_UART_TX_PORT PORTE           /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_KW41_UART_TX_PIN 25U              /*!<@brief PORTE pin index: 25 */
#define BOARD_INITPINS_KW41_UART_TX_PIN_NAME UART4_RX    /*!<@brief Pin name */
#define BOARD_INITPINS_KW41_UART_TX_LABEL "KW41_UART_TX" /*!<@brief Label */
#define BOARD_INITPINS_KW41_UART_TX_NAME "KW41_UART_TX"  /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PORTE26 (coord K4), KW41_UART_RTS
  @{ */
#define BOARD_INITPINS_KW41_UART_RTS_PERIPHERAL UART4      /*!<@brief Device name: UART4 */
#define BOARD_INITPINS_KW41_UART_RTS_SIGNAL CTS            /*!<@brief UART4 signal: CTS */
#define BOARD_INITPINS_KW41_UART_RTS_GPIO GPIOE            /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_KW41_UART_RTS_PORT PORTE            /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_KW41_UART_RTS_PIN 26U               /*!<@brief PORTE pin index: 26 */
#define BOARD_INITPINS_KW41_UART_RTS_PIN_NAME UART4_CTS_b  /*!<@brief Pin name */
#define BOARD_INITPINS_KW41_UART_RTS_LABEL "KW41_UART_RTS" /*!<@brief Label */
#define BOARD_INITPINS_KW41_UART_RTS_NAME "KW41_UART_RTS"  /*!<@brief Identifier name */
                                                           /* @} */

/*! @name PORTE27 (coord J4), KW41_UART_CTS
  @{ */
#define BOARD_INITPINS_KW41_UART_CTS_PERIPHERAL UART4      /*!<@brief Device name: UART4 */
#define BOARD_INITPINS_KW41_UART_CTS_SIGNAL RTS            /*!<@brief UART4 signal: RTS */
#define BOARD_INITPINS_KW41_UART_CTS_GPIO GPIOE            /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_KW41_UART_CTS_PORT PORTE            /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_KW41_UART_CTS_PIN 27U               /*!<@brief PORTE pin index: 27 */
#define BOARD_INITPINS_KW41_UART_CTS_PIN_NAME UART4_RTS_b  /*!<@brief Pin name */
#define BOARD_INITPINS_KW41_UART_CTS_LABEL "KW41_UART_CTS" /*!<@brief Label */
#define BOARD_INITPINS_KW41_UART_CTS_NAME "KW41_UART_CTS"  /*!<@brief Identifier name */
                                                           /* @} */

