theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTE28 (coord H4), USER_SW4
  @{ */
#define BOARD_INITPINS_USER_SW4_PERIPHERAL GPIOE                  /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_USER_SW4_SIGNAL GPIO                       /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_USER_SW4_GPIO GPIOE                        /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_USER_SW4_GPIO_PIN 28U                      /*!<@brief PORTE pin index: 28 */
#define BOARD_INITPINS_USER_SW4_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_USER_SW4_PIN 28U                           /*!<@brief PORTE pin index: 28 */
#define BOARD_INITPINS_USER_SW4_CHANNEL 28                        /*!<@brief GPIOE GPIO channel: 28 */
#define BOARD_INITPINS_USER_SW4_PIN_NAME PTE28                    /*!<@brief Pin name */
#define BOARD_INITPINS_USER_SW4_LABEL "USER_SW4"                  /*!<@brief Label */
#define BOARD_INITPINS_USER_SW4_NAME "USER_SW4"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_USER_SW4_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name USB0_DP (coord H1), USB_DP
  @{ */
#define BOARD_INITPINS_USB_DP_PERIPHERAL USB0  /*!<@brief Device name: USB0 */
#define BOARD_INITPINS_USB_DP_SIGNAL DP        /*!<@brief USB0 signal: DP */
#define BOARD_INITPINS_USB_DP_PIN_NAME USB0_DP /*!<@brief Pin name */
#define BOARD_INITPINS_USB_DP_LABEL "USB_DP"   /*!<@brief Label */
#define BOARD_INITPINS_USB_DP_NAME "USB_DP"    /*!<@brief Identifier name */
                                               /* @} */

/*! @name USB0_DM (coord H2), USB_DM
  @{ */
#define BOARD_INITPINS_USB_DM_PERIPHERAL USB0  /*!<@brief Device name: USB0 */
#define BOARD_INITPINS_USB_DM_SIGNAL DM        /*!<@brief USB0 signal: DM */
#define BOARD_INITPINS_USB_DM_PIN_NAME USB0_DM /*!<@brief Pin name */
#define BOARD_INITPINS_USB_DM_LABEL "USB_DM"   /*!<@brief Label */
#define BOARD_INITPINS_USB_DM_NAME "USB_DM"    /*!<@brief Identifier name */
                                               /* @} */

/*! @name ADC0_SE21 (coord J3), BAT_SENS
  @{ */
#define BOARD_INITPINS_BAT_SENS_PERIPHERAL ADC0    /*!<@brief Device name: ADC0 */
#define BOARD_INITPINS_BAT_SENS_SIGNAL SE          /*!<@brief ADC0 signal: SE */
#define BOARD_INITPINS_BAT_SENS_CHANNEL 21         /*!<@brief ADC0 SE channel: 21 */
#define BOARD_INITPINS_BAT_SENS_PIN_NAME ADC0_SE21 /*!<@brief Pin name */
#define BOARD_INITPINS_BAT_SENS_LABEL "BAT_SENS"   /*!<@brief Label */
#define BOARD_INITPINS_BAT_SENS_NAME "BAT_SENS"    /*!<@brief Identifier name */
                                                   /* @} */

/*! @name ADC0_SE22 (coord K3), MB1_AN
  @{ */
#define BOARD_INITPINS_MB1_AN_PERIPHERAL ADC0    /*!<@brief Device name: ADC0 */
#define BOARD_INITPINS_MB1_AN_SIGNAL SE          /*!<@brief ADC0 signal: SE */
#define BOARD_INITPINS_MB1_AN_CHANNEL 22         /*!<@brief ADC0 SE channel: 22 */
#define BOARD_INITPINS_MB1_AN_PIN_NAME ADC0_SE22 /*!<@brief Pin name */
#define BOARD_INITPINS_MB1_AN_LABEL "MB1_AN"     /*!<@brief Label */
#define BOARD_INITPINS_MB1_AN_NAME "MB1_AN"      /*!<@brief Identifier name */
                                                 /* @} */

/*! @name ADC0_SE23 (coord L3), MB2_AN
  @{ */
#define BOARD_INITPINS_MB2_AN_PERIPHERAL ADC0    /*!<@brief Device name: ADC0 */
#define BOARD_INITPINS_MB2_AN_SIGNAL SE          /*!<@brief ADC0 signal: SE */
#define BOARD_INITPINS_MB2_AN_CHANNEL 23         /*!<@brief ADC0 SE channel: 23 */
#define BOARD_INITPINS_MB2_AN_PIN_NAME ADC0_SE23 /*!<@brief Pin name */
#define BOARD_INITPINS_MB2_AN_LABEL "MB2_AN"     /*!<@brief Label */
#define BOARD_INITPINS_MB2_AN_NAME "MB2_AN"      /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EXTAL32 (coord M6), K64_EXTAL32
  @{ */
#define BOARD_INITPINS_K64_EXTAL32_PERIPHERAL RTC      /*!<@brief Device name: RTC */
#define BOARD_INITPINS_K64_EXTAL32_SIGNAL EXTAL32      /*!<@brief RTC signal: EXTAL32 */
#define BOARD_INITPINS_K64_EXTAL32_PIN_NAME EXTAL32    /*!<@brief Pin name */
#define BOARD_INITPINS_K64_EXTAL32_LABEL "K64_EXTAL32" /*!<@brief Label */
#define BOARD_INITPINS_K64_EXTAL32_NAME "K64_EXTAL32"  /*!<@brief Identifier name */
                                                       /* @} */

/*! @name PORTE7 (coord F4), RGB_G
  @{ */
#define BOARD_INITPINS_RGB_G_PERIPHERAL FTM3                    /*!<@brief Device name: FTM3 */
#define BOARD_INITPINS_RGB_G_SIGNAL CH                          /*!<@brief FTM3 signal: CH */
#define BOARD_INITPINS_RGB_G_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_RGB_G_PIN 7U                             /*!<@brief PORTE pin index: 7 */
#define BOARD_INITPINS_RGB_G_CHANNEL 2                          /*!<@brief FTM3 channel: 2 */
#define BOARD_INITPINS_RGB_G_PIN_NAME FTM3_CH2                  /*!<@brief Pin name */
#define BOARD_INITPINS_RGB_G_LABEL "RGB_G"                      /*!<@brief Label */
#define BOARD_INITPINS_RGB_G_NAME "RGB_G"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_RGB_G_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTC9 (coord D7), RGB_B
  @{ */
#define BOARD_INITPINS_RGB_B_PERIPHERAL FTM3                    /*!<@brief Device name: FTM3 */
#define BOARD_INITPINS_RGB_B_SIGNAL CH                          /*!<@brief FTM3 signal: CH */
#define BOARD_INITPINS_RGB_B_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_RGB_B_PIN 9U                             /*!<@brief PORTC pin index: 9 */
#define BOARD_INITPINS_RGB_B_CHANNEL 5                          /*!<@brief FTM3 channel: 5 */
#define BOARD_INITPINS_RGB_B_PIN_NAME FTM3_CH5                  /*!<@brief Pin name */
#define BOARD_INITPINS_RGB_B_LABEL "RGB_B"                      /*!<@brief Label */
#define BOARD_INITPINS_RGB_B_NAME "RGB_B"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_RGB_B_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

