theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTC8 (coord A8), RGB_R
  @{ */
#define BOARD_INITPINS_RGB_R_PERIPHERAL FTM3                    /*!<@brief Device name: FTM3 */
#define BOARD_INITPINS_RGB_R_SIGNAL CH                          /*!<@brief FTM3 signal: CH */
#define BOARD_INITPINS_RGB_R_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_RGB_R_PIN 8U                             /*!<@brief PORTC pin index: 8 */
#define BOARD_INITPINS_RGB_R_CHANNEL 4                          /*!<@brief FTM3 channel: 4 */
#define BOARD_INITPINS_RGB_R_PIN_NAME FTM3_CH4                  /*!<@brief Pin name */
#define BOARD_INITPINS_RGB_R_LABEL "RGB_R"                      /*!<@brief Label */
#define BOARD_INITPINS_RGB_R_NAME "RGB_R"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_RGB_R_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTD8 (coord C9), AIR_QUALITY_I2C_EN
  @{ */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_GPIO_PIN 8U                        /*!<@brief PORTD pin index: 8 */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_PIN 8U                             /*!<@brief PORTD pin index: 8 */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_CHANNEL 8                          /*!<@brief GPIOD GPIO channel: 8 */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_PIN_NAME PTD8                      /*!<@brief Pin name */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_LABEL "AIR_QUALITY_I2C_EN"         /*!<@brief Label */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_NAME "AIR_QUALITY_I2C_EN"          /*!<@brief Identifier name */
#define BOARD_INITPINS_AIR_QUALITY_I2C_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                             /* @} */

/*! @name PORTA9 (coord L8), TOUCH_INT
  @{ */
#define BOARD_INITPINS_TOUCH_INT_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_TOUCH_INT_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_TOUCH_INT_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_TOUCH_INT_GPIO_PIN 9U                       /*!<@brief PORTA pin index: 9 */
#define BOARD_INITPINS_TOUCH_INT_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_TOUCH_INT_PIN 9U                            /*!<@brief PORTA pin index: 9 */
#define BOARD_INITPINS_TOUCH_INT_CHANNEL 9                         /*!<@brief GPIOA GPIO channel: 9 */
#define BOARD_INITPINS_TOUCH_INT_PIN_NAME PTA9                     /*!<@brief Pin name */
#define BOARD_INITPINS_TOUCH_INT_LABEL "TOUCH_INT"                 /*!<@brief Label */
#define BOARD_INITPINS_TOUCH_INT_NAME "TOUCH_INT"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_TOUCH_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTB5 (coord G9), NTAG_I2C_EN
  @{ */
#define BOARD_INITPINS_NTAG_I2C_EN_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_NTAG_I2C_EN_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_NTAG_I2C_EN_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_NTAG_I2C_EN_GPIO_PIN 5U                        /*!<@brief PORTB pin index: 5 */
#define BOARD_INITPINS_NTAG_I2C_EN_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_NTAG_I2C_EN_PIN 5U                             /*!<@brief PORTB pin index: 5 */
#define BOARD_INITPINS_NTAG_I2C_EN_CHANNEL 5                          /*!<@brief GPIOB GPIO channel: 5 */
#define BOARD_INITPINS_NTAG_I2C_EN_PIN_NAME PTB5                      /*!<@brief Pin name */
#define BOARD_INITPINS_NTAG_I2C_EN_LABEL "NTAG_I2C_EN"                /*!<@brief Label */
#define BOARD_INITPINS_NTAG_I2C_EN_NAME "NTAG_I2C_EN"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_NTAG_I2C_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*! @name PORTE12 (coord G3), DISP_BLIGHT
  @{ */
#define BOARD_INITPINS_DISP_BLIGHT_PERIPHERAL FTM3                    /*!<@brief Device name: FTM3 */
#define BOARD_INITPINS_DISP_BLIGHT_SIGNAL CH                          /*!<@brief FTM3 signal: CH */
#define BOARD_INITPINS_DISP_BLIGHT_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_DISP_BLIGHT_PIN 12U                            /*!<@brief PORTE pin index: 12 */
#define BOARD_INITPINS_DISP_BLIGHT_CHANNEL 7                          /*!<@brief FTM3 channel: 7 */
#define BOARD_INITPINS_DISP_BLIGHT_PIN_NAME FTM3_CH7                  /*!<@brief Pin name */
#define BOARD_INITPINS_DISP_BLIGHT_LABEL "DISP_BLIGHT"                /*!<@brief Label */
#define BOARD_INITPINS_DISP_BLIGHT_NAME "DISP_BLIGHT"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_DISP_BLIGHT_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTD0 (coord A5), RTC_INT
  @{ */
#define RTC_INT_IRQ_RTC_INT_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define RTC_INT_IRQ_RTC_INT_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define RTC_INT_IRQ_RTC_INT_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define RTC_INT_IRQ_RTC_INT_GPIO_PIN 0U                       /*!<@brief PORTD pin index: 0 */
#define RTC_INT_IRQ_RTC_INT_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define RTC_INT_IRQ_RTC_INT_PIN 0U                            /*!<@brief PORTD pin index: 0 */
#define RTC_INT_IRQ_RTC_INT_CHANNEL 0                         /*!<@brief GPIOD GPIO channel: 0 */
#define RTC_INT_IRQ_RTC_INT_PIN_NAME PTD0                     /*!<@brief Pin name */
#define RTC_INT_IRQ_RTC_INT_LABEL "RTC_INT"                   /*!<@brief Label */
#define RTC_INT_IRQ_RTC_INT_NAME "RTC_INT"                    /*!<@brief Identifier name */
#define RTC_INT_IRQ_RTC_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTC_INT_IRQ(void);

/*! @name PORTB21 (coord D9), DISP_SPI_SCK
  @{ */
#define DSPI2_INITPINS_DISP_SPI_SCK_PERIPHERAL SPI2      /*!<@brief Device name: SPI2 */
#define DSPI2_INITPINS_DISP_SPI_SCK_SIGNAL SCK           /*!<@brief SPI2 signal: SCK */
#define DSPI2_INITPINS_DISP_SPI_SCK_PORT PORTB           /*!<@brief PORT device name: PORTB */
#define DSPI2_INITPINS_DISP_SPI_SCK_PIN 21U              /*!<@brief PORTB pin index: 21 */
#define DSPI2_INITPINS_DISP_SPI_SCK_PIN_NAME SPI2_SCK    /*!<@brief Pin name */
#define DSPI2_INITPINS_DISP_SPI_SCK_LABEL "DISP_SPI_SCK" /*!<@brief Label */
#define DSPI2_INITPINS_DISP_SPI_SCK_NAME "DISP_SPI_SCK"  /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PORTB22 (coord C12), DISP_SPI_SDI
  @{ */
#define DSPI2_INITPINS_DISP_SPI_SDI_PERIPHERAL SPI2      /*!<@brief Device name: SPI2 */
#define DSPI2_INITPINS_DISP_SPI_SDI_SIGNAL SOUT          /*!<@brief SPI2 signal: SOUT */
#define DSPI2_INITPINS_DISP_SPI_SDI_PORT PORTB           /*!<@brief PORT device name: PORTB */
#define DSPI2_INITPINS_DISP_SPI_SDI_PIN 22U              /*!<@brief PORTB pin index: 22 */
#define DSPI2_INITPINS_DISP_SPI_SDI_PIN_NAME SPI2_SOUT   /*!<@brief Pin name */
#define DSPI2_INITPINS_DISP_SPI_SDI_LABEL "DISP_SPI_SDI" /*!<@brief Label */
#define DSPI2_INITPINS_DISP_SPI_SDI_NAME "DISP_SPI_SDI"  /*!<@brief Identifier name */
                                                         /* @} */

