theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.h
/*! @name PORTB20 (coord D10), DISP_SPI_CS
  @{ */
#define DSPI2_INITPINS_DISP_SPI_CS_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define DSPI2_INITPINS_DISP_SPI_CS_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define DSPI2_INITPINS_DISP_SPI_CS_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define DSPI2_INITPINS_DISP_SPI_CS_GPIO_PIN 20U                       /*!<@brief PORTB pin index: 20 */
#define DSPI2_INITPINS_DISP_SPI_CS_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define DSPI2_INITPINS_DISP_SPI_CS_PIN 20U                            /*!<@brief PORTB pin index: 20 */
#define DSPI2_INITPINS_DISP_SPI_CS_CHANNEL 20                         /*!<@brief GPIOB GPIO channel: 20 */
#define DSPI2_INITPINS_DISP_SPI_CS_PIN_NAME PTB20                     /*!<@brief Pin name */
#define DSPI2_INITPINS_DISP_SPI_CS_LABEL "DISP_SPI_CS"                /*!<@brief Label */
#define DSPI2_INITPINS_DISP_SPI_CS_NAME "DISP_SPI_CS"                 /*!<@brief Identifier name */
#define DSPI2_INITPINS_DISP_SPI_CS_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void DSPI2_InitPins(void);

/*! @name PORTB21 (coord D9), DISP_SPI_SCK
  @{ */
#define DSPI2_DEINITPINS_DISP_SPI_SCK_PERIPHERAL n/a                           /*!<@brief Device name: n/a */
#define DSPI2_DEINITPINS_DISP_SPI_SCK_SIGNAL disabled                          /*!<@brief n/a signal: disabled */
#define DSPI2_DEINITPINS_DISP_SPI_SCK_PORT PORTB                               /*!<@brief PORT device name: PORTB */
#define DSPI2_DEINITPINS_DISP_SPI_SCK_PIN 21U                                  /*!<@brief PORTB pin index: 21 */
#define DSPI2_DEINITPINS_DISP_SPI_SCK_PIN_NAME PTB21/SPI2_SCK/FB_AD30/CMP1_OUT /*!<@brief Pin name */
#define DSPI2_DEINITPINS_DISP_SPI_SCK_LABEL "DISP_SPI_SCK"                     /*!<@brief Label */
#define DSPI2_DEINITPINS_DISP_SPI_SCK_NAME "DISP_SPI_SCK"                      /*!<@brief Identifier name */
                                                                               /* @} */

/*! @name PORTB20 (coord D10), DISP_SPI_CS
  @{ */
#define DSPI2_DEINITPINS_DISP_SPI_CS_PERIPHERAL n/a                            /*!<@brief Device name: n/a */
#define DSPI2_DEINITPINS_DISP_SPI_CS_SIGNAL disabled                           /*!<@brief n/a signal: disabled */
#define DSPI2_DEINITPINS_DISP_SPI_CS_PORT PORTB                                /*!<@brief PORT device name: PORTB */
#define DSPI2_DEINITPINS_DISP_SPI_CS_PIN 20U                                   /*!<@brief PORTB pin index: 20 */
#define DSPI2_DEINITPINS_DISP_SPI_CS_PIN_NAME PTB20/SPI2_PCS0/FB_AD31/CMP0_OUT /*!<@brief Pin name */
#define DSPI2_DEINITPINS_DISP_SPI_CS_LABEL "DISP_SPI_CS"                       /*!<@brief Label */
#define DSPI2_DEINITPINS_DISP_SPI_CS_NAME "DISP_SPI_CS"                        /*!<@brief Identifier name */
                                                                               /* @} */

/*! @name PORTB22 (coord C12), DISP_SPI_SDI
  @{ */
#define DSPI2_DEINITPINS_DISP_SPI_SDI_PERIPHERAL n/a                            /*!<@brief Device name: n/a */
#define DSPI2_DEINITPINS_DISP_SPI_SDI_SIGNAL disabled                           /*!<@brief n/a signal: disabled */
#define DSPI2_DEINITPINS_DISP_SPI_SDI_PORT PORTB                                /*!<@brief PORT device name: PORTB */
#define DSPI2_DEINITPINS_DISP_SPI_SDI_PIN 22U                                   /*!<@brief PORTB pin index: 22 */
#define DSPI2_DEINITPINS_DISP_SPI_SDI_PIN_NAME PTB22/SPI2_SOUT/FB_AD29/CMP2_OUT /*!<@brief Pin name */
#define DSPI2_DEINITPINS_DISP_SPI_SDI_LABEL "DISP_SPI_SDI"                      /*!<@brief Label */
#define DSPI2_DEINITPINS_DISP_SPI_SDI_NAME "DISP_SPI_SDI"                       /*!<@brief Identifier name */
                                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void DSPI2_DeinitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
